goal-app/app/models/user.rb

  def reset_session_token!
    self.update!(session_token: User.generate_session_token)
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "eCCtOMBybKZyaWqfsW6buQ"], ["updated_at", "2019-07-05 20:16:01.941466"], ["id", 1]]